blog-posts/2007-11-10-my-worrying-is-useless.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>My worrying is useless</title>
<!-- 2014-04-30 Wed 17:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">My worrying is useless</h1>
<p>
November 10th, 2007 -
<a href="http://sachachua.com/blog/p/4440"><a href="http://sachachua.com/blog/p/4440">http://sachachua.com/blog/p/4440</a></a>
</p>

<p>
I came across this beautiful quote from Anne Patchett's memoir “Truth
 and Beauty” on the
<a href="http://www.happiness-project.com/happiness_projerct/2007/11/this-saturday-1.html">Happiness
Project blog</a>:
</p>

<blockquote>
<p>
“I knew then it was just too enormous for me to manage and that
 worrying about her would swamp me. If I was swamped by worry, I would
 be useless to her. It was even possible that I would desert her, and
 that was the thing that could never happen. I decided that night I
 would take all the hourts of my life that could so easily be spent
 worrying and instead I would try to help her.”
</p>
</blockquote>

<p>
That's it. That makes sense. I can't afford to feel all down about
 myself, boohoo, I'm living in two worlds and all of that. Not when I
 can take that time and that energy and do something <b>wonderful.</b>
</p>

<p>
Random Emacs symbol: planner-multi-read-name-multiple-prompts &#x2013;
Function: Read multiple pages, completing based on FILE-ALIST.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
